---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs.PathName
source: html/66c95308-4a86-1e63-c133-d00dbc2b9af6.htm
---
# Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs.PathName Property

Target path to which the document is to be saved.

## Syntax (C#)
```csharp
public string PathName { get; }
```